# 'brew tap'
# tap "homebrew/cask"
# 'brew tap' with custom Git URL
# tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git"
# set arguments for all 'brew install --cask' commands
# cask_args appdir: "~/Applications", require_sha: true

# 'brew install'
# brew "imagemagick"
# 'brew install --with-rmtp', 'brew services restart' on version changes
# brew "denji/nginx/nginx-full", args: ["with-rmtp"], restart_service: :changed
# 'brew install', always 'brew services restart', 'brew link', 'brew unlink mysql' (if it is installed)
# brew "mysql@5.6", restart_service: true, link: true, conflicts_with: ["mysql"]

# 'brew install --cask'
# cask "google-chrome"
# 'brew install --cask --appdir=~/my-apps/Applications'
# cask "firefox", args: { appdir: "~/my-apps/Applications" }
# 'brew install --cask' only if '/usr/libexec/java_home --failfast' fails
# cask "java" unless system "/usr/libexec/java_home --failfast"

# 'mas install'
# mas "1Password", id: 443987910

# 'whalebrew install'
# whalebrew "whalebrew/wget"

tap "railwaycat/emacsmacport"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "adr-tools"
brew "angband"
brew "antigen"
brew "aspell"
brew "autoconf"
brew "automake"
brew "avanor"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "boot-clj"
brew "borkdude/brew/babashka"
brew "borkdude/brew/clj-kondo"
brew "borkdude/brew/jet"
brew "cataclysm"
brew "clojure"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "cmake"
brew "coreutils"
brew "fd"
brew "ffmpeg"
brew "flac"
brew "git"
brew "git-annex"
brew "git-delta"
brew "gnu-typist"
brew "gnupg"
brew "gnutls"
brew "graphviz"
brew "htop"
brew "leiningen"
brew "makefile2graph"
brew "nmap"
brew "node"
brew "pass"
brew "pgcli"
brew "pinentry"
brew "pinentry-mac"
brew "pkg-config"
brew "postgres"
brew "prettier"
brew "pwgen"
brew "python3"
brew "rclone"
brew "ripgrep"
brew "rlwrap"
brew "shellcheck"
brew "siege"
# Doesn't work
# brew "sshfs"
brew "svn"
brew "texinfo"
brew "trash"
brew "unnethack"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "youtube-dl"

# yubikey
brew "gnupg"
brew "hopenpgp-tools"
brew "pinentry-mac"
brew "ykman"
brew "yubikey-personalization"

cask "1password-cli"
cask "chromium"
cask "dwarf-fortress-lmp"
cask "emacs-mac"
cask "iterm2"
cask "menumeters"
# no bottle
# cask "osxfuse"
# Already installed?
# cask "qlstephen"
cask "racket"
cask "rectangle"
cask "secretive"
cask "slack"
cask "vlc"
cask "yacreader"

# Fonts
cask "font-fira-code"
cask "font-source-code-pro"
cask "font-inconsolata"
